---
type: OBJImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# OBJImportOptions

`Autodesk.Revit.DB.OBJImportOptions` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | OBJImportOptions | — | `` |
| Constructor | OBJImportOptions | 2022.1 | `public OBJImportOptions ()` |